#include <iostream>
#include"map.h"
using namespace std;

int main()
{
Map mymap;

/*
mymap.y();
 cout<<"                         whelecome to JLU"<<endl;
    cout<<"********************************************************************************"<<endl;

cout<<"                             1-东门 "<<endl;
cout<<"                             2-图书馆 "<<endl;
cout<<"                             3-行政楼  "<<endl;
cout<<"                             4-莘子园  "<<endl;
cout<<"                             5-新食堂  "<<endl;
 cout<<"********************************************************************************"<<endl;
    cout<<"请选择功能:"<<endl<<"0-退出"<<endl<<"1-查询景点信息"<<endl<<"2-查询最短路线"<<endl<<"3-修改信息（管理员才能修改）"<<endl;
     cout<<"********************************************************************************"<<endl;
 int choice=1;
 cin>>choice;
 while(choice!=0)
   {
       mymap.Display(choice);
    cout<<"                         whelecome to JLU"<<endl;
    cout<<"********************************************************************************"<<endl;
    cout<<"请选择功能:"<<endl<<"0-退出"<<endl<<"1-查询景点信息"<<endl<<"2-查询最短路线"<<endl<<"3-修改信息（管理员才能修改）"<<endl;
     cout<<"********************************************************************************"<<endl;
  cin>>choice;
   }*/
    return 0;
}
